"ERROR_PARSE_FILENOTFOUND"="It is not found any file specified for %s"
"ERROR_PARSE_OUTPUTPATH"="Invalid output file/path for %s"

"ERROR_IS7ZIP_FILESEEK"="There was an error in the positioning of the filestream in the module IS7zipExtract!"
"ERROR_IS7ZIP_FILECREATE"="An error occurred creating a filestream%n%s%nin the module IS7zipExtract!"
"ERROR_IS7ZIP_FILEOPEN"="There was an error opening the filestream%n%s%nin the module IS7zipExtract!"
"ERROR_IS7ZIP_COLFILES"="Error in determining the number of files in the archive in the module IS7zipExtract!"
"ERROR_IS7ZIP_NOTOPEN"="Failed to open the archive in the module IS7zipExtract!"
"ERROR_IS7ZIP_CORRUPT"="Error extracting data from the 7z-archive. Perhaps it is corrupted!"
"ERROR_IS7ZIP_EXCEPT"="Error in the archive or an unexpected error in the module IS7zipExtract!"

"ERROR_ISARC_LOADDLL"="An error occurred while loading Unarc.dll!"
"ERROR_ISARC_GENERAL"="An error occurred when unpacking!%nUnarc.dll returned an error code: -1%n%s"
"ERROR_ISARC_INVALID_COMPRESSOR"="An error occurred while unpacking: Unknown compression method!%nUnarc.dll returned an error code: -2%n%s"
"ERROR_ISARC_ONLY_DECOMPRESS"="An error occurred when unpacking!%nUnarc.dll returned an error code: -3%n%s"
"ERROR_ISARC_OUTBLOCK_TOO_SMALL"="An error occurred while unpacking: Output data block too small!%nUnarc.dll returned an error code: -4%n%s"
"ERROR_ISARC_NOT_ENOUGH_MEMORY"="An error occurred while unpacking: Not enough memory!%nUnarc.dll returned an error code: -5%n%s"
"ERROR_ISARC_READ"="An error occurred while unpacking: Unable to read data!%nUnarc.dll returned an error code: -6%n%s"
"ERROR_ISARC_BAD_COMPRESSED_DATA"="An error occurred while unpacking: archive corrupted!%nUnarc.dll returned an error code: -7%n%s"
"ERROR_ISARC_NOT_IMPLEMENTED"="An error occurred while unpacking: Required features are not supported by DLL!%nUnarc.dll returned an error code: -8%n%s"
"ERROR_ISARC_NO_MORE_DATA_REQUIRED"="An error occurred while unpacking: The requested data has been extracted!%nUnarc.dll returned an error code: -9%n%s"
"ERROR_ISARC_WRITE"="An error occurred while unpacking: Unable to write data to disk!%nUnarc.dll returned an error code: -11%n%s"
"ERROR_ISARC_BAD_CRC"="An error occurred while unpacking: Does not match checksum!%nUnarc.dll returned an error code: -12%n%s"
"ERROR_ISARC_BAD_PASSWORD"="An error occurred while decompressing: Invalid password!%nUnarc.dll returned an error code: -13%n%s"
"ERROR_ISARC_BAD_HEADERS"="An error occurred while decompressing: Archive header is corrupt!%nUnarc.dll returned an error code: -14%n%s"
"ERROR_ISARC_INTERNAL"="An error occurred while unpacking: Internal error DLL!%nUnarc.dll returned an error code: -15%n%s"
"ERROR_ISARC_UNKNOWN"="An error occurred while unpacking!%n%s"
"ERROR_ISARC_EXCEPT"="Error in the archive or an unexpected error in the module ISArcExtract!"

"ERROR_ISPCF_CANT_OPEN_INFILE"="An error occurred accessing the input file%n%s%nin the module ISPrecompExtract"
"ERROR_ISPCF_ISNOTPCF"="Invalid format of PCF-File:%n%s"
"ERROR_ISPCF_UNKNOWN_VERSION"="Unknown version of PCF-file:%n%s"
"ERROR_ISPCF_ACCESS_TO_OUTFILE"="In module ISPrecompExtract it is not possible to get access to an output file:%n%s"
"ERROR_ISPCF_LAUNCH_PROC"="Error start of the console application %s"
"WARNING_ISPCF_OPEN_PROC"="Error at process opening in ISPrecompExtract.%nPerhaps the installer not authorized.%nProgress of some operations will not be available!"
"ERROR_ISPCF_CANT_FIND_OUTFILE"="File has not been created by the console application%n%s%nProbably error or incorrect format of a pcf-file"
"ERROR_ISPCF_EXCEPT"="An unexpected error in the module ISPrecompExtract!"

"ERROR_ISSREP_GENERAL"="There was an error in the module ISSrepExtract!%n%s"
"ERROR_ISSREP_ACCESS_TO_OUTFILE"="In the module ISSrepExtract can not access to the output file:%n%s"
"ERROR_ISSREP_EXCEPT"="An unexpected error in the module ISSrepExtract!"

"ERROR_ISRAR_MULTIVOLUME"="multipart .rar archives with the data on different disks are not supported!"
"ERROR_ISRAR_DLL_NOT_FOUND"="Unable to find DLL %s"
"ERROR_ISRAR_EXCEPT"="Error in archive or an unexpected error in the module ISRarExtract!"

"ERROR_M3PACK_ACCESS_TO_OUTFILE"="In module ISm3unpack it is not possible to get access to an output file:%n%s"
"ERROR_M3PACK_EXCEPT"="An unexpected error in the module ISm3unpack!"),

"ERROR_UNPACK_ACCESS_TO_OUTFILE"="In module ISUnpack it is not possible to get access to an output file:%n%s"
"ERROR_UNPACK_LAUNCH_PROC"="Error start of the console application in ISUnpack!"
"WARNING_UNPACK_OPEN_PROC"="Error at process opening in ISUnpack.%nPerhaps the installer not authorized.%nProgress of some operations will not be available!"
"ERROR_UNPACK_CANT_FIND_OUTFILE"="File has not been created by the console application%n%s%nMaybe an error or an incorrect format of unpack-file"
"ERROR_UNPACK_EXCEPT"="An unexpected error in the module ISUnpack!"

"ERROR_XDELTA_GENERAL"="There was an error of unpacking in the module ISxDeltaExtract!"
"ERROR_XDELTA_CANT_GET_MEM"="Error when allocating memory to perform operations in ISxDeltaExtract!"
"ERROR_XDELTA_DLL_NOT_FOUND"="Unable to find DLL %s"
"ERROR_XDELTA_ACCESS_TO_OUTFILE"="In module ISxDeltaExtract it is not possible to get access to an output file:%n%s"
"ERROR_XDELTA_EXCEPT"="An unexpected error in the module ISxDeltaExtract!"

"ERROR_PACKZIP_BAD_INFILE"="Invalid input path for ISPackZIP"
"ERROR_PACKZIP_BAD_OUTFILE"="Invalid output file for ISPackZIP"
"ERROR_PACKZIP_BAD_COMPRESSION_LVL"="The compression settings for ISPackZIP Should be in limits 0..9"
"ERROR_PACKZIP_ACCESS_TO_OUTFILE"="In module ISPackZIP it is not possible to get access to an output file:%n%s"
"ERROR_PACKZIP_LAUNCH_PROC"="Error start of the console application %s"
"WARNING_PACKZIP_OPEN_PROC"="Error at process opening in ISPackZIP.%nPerhaps the installer not authorized.%nProgress of some operations will not be available!"
"ERROR_PACKZIP_CANT_FIND_OUTFILE"="File has not been created by the console application%n%s%nIn module ISPackZIP"
"ERROR_PACKZIP_EXCEPT"="An unexpected error in the module ISPackZIP!"

"ERROR_INIT_LOW_MEM"="Not enough memory to unpack!%nTry to close all opened programs and then restart the installer"
"ERROR_INIT_CANT_GET_MEM"="Memory allocation error when initializing the DLL!"
"WARNING_INIT_SREP_BAD_PARAM"="When initializing srep specify a value no more 4096mb.%nTo not display this message, correct the compliant parameter."
"ERROR_INIT_PRECOMP_BAD_PARAM"="During initialization Precomp, incorrect version given!"

"ERROR_FINFILES_EXCEPT"="An unexpected error in the module ISFindFiles!"
"ERROR_PICKFILE_EXCEPT"="An unexpected error in the module ISPickFilename!"
"ERROR_EXEC_LAUNCH_PROC"="Start error%n%s%nin the module ISExec!"
"ERROR_EXEC_EXCEPT"="An unexpected error in the module ISExec!"

"CHANGE_DISK_TITLE"="Setup needs the next disk"
"CHANGE_DISK_LABEL"="If the files on this disk can be found in a folder other than the one displayed below, enter the correct path or click Browse"
"BROWSE_TITLE"="Browse"
"BROWSE_LABEL"="Please specify the path to the next disc"
"BUTTON_OK"="OK"
"BUTTON_CANCEL"="Cancel"
"BUTTON_BROWSE"="Browse..."

"TIME_HOUR_SHORT"=" h "
"TIME_MIN_SHORT"=" min "
"TIME_SEC_SHORT1"=" sec"
"TIME_SEC_SHORT2"=" s"
"TIME_HOUR_FULL1"="hours "
"TIME_HOUR_FULL2"="hour "
"TIME_HOUR_FULL3"="hour "
"TIME_MIN_FULL1"="minutes "
"TIME_MIN_FULL2"="minute "
"TIME_MIN_FULL3"="minutes "
"TIME_SEC_FULL1"="seconds "
"TIME_SEC_FULL2"="second "
"TIME_SEC_FULL3"="seconds "
"TIME_TYPE1"="Remain: "
"TIME_TYPE2"="Passed: "
"TIME_TYPE3"="Total: "
"TIME_TYPE4"="Wait "
"TIME_INFINITE"="eternity"
"TIME_TEST"="Test Run"
"GENERAL_ENDING"="Finalization..."
"GENERAL_DELETING"="Deleting temporary files..."
"GENERAL_SCANNING"="Scanning files..."
